<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<!-- 1단계 로그인 프로그램 -->
	<!-- 로그인 폼을 만들고 아이디와 비밀번호를 입력하면 입력된 내용이 화면에 출력이 되도록 코드를 작성하세요. -->
	<a href = "login_form.jsp">로그인 하러 가기</a><br>
	
	<!-- 2단계 로그인 프로그램 -->
	<!-- 로그인 폼을 만들고 아이디와 비밀번호를 입력하면 이미 저장된 아이디와 비밀번호(green/1234)를 비교해서 둘다 일치하면 로그인 성공페이지로 이동하고
	둘중 하나라도 일치하지 않으면 로그인 실패 페이지로 이동하도록 코드를 작성하세요. -->
	<a href = "login_form1.jsp">2단계 로그인 하러 가기</a>
	
	<!-- 3단계 로그인 프로그램 -->
	<!-- 2단계 프로그램에서 로그인 성공시 아이디를 세션에 저장하는 코드를 추가하세요. -->
	<!-- 로그인 하지 않은 상태에서 로그인 성공페이지를 주소창을 통해서 직접 들어간 경우 로그인 폼페이지로 이동하도록 코드를 작성하세요. -->
	<!-- 로그인 한 상태에서 로그인 폼페이지로 주소창으로 통해서 직접 이동한 경우 로그인 성공페이지로 이동하도록 코드를 작성하세요. -->
	<a href = "login_form2.jsp">3단계 로그인 하러 가기</a>
	
	<!-- 4단계 회원 가입 프로그램 -->
	<!-- 회원 가입 폼을 만들고 입력하면 입력된 내용이 화면에 출력이 되도록 코드를 작성하세요. -->
	<!-- 아이디, 비밀번호, 이름, 전화번호등 정보를 입력 받습니다. -->
	
	<!-- 5단계 회원 가입 프로그램 -->
</body>
</html>